[
    {
        "title": "18m. Try me",
        "comments": [
            "Not a chance, I'm not risking your classmates lives for a chuckle.",
            "diary of a simpy kid.",
            "I’m assuming the green walls are to easily CGI some friends in your life",
            "You got the face of a medieval peasant.",
            "You just know this guy has at least one full 2L bottle of piss in his room and is a self described \"nice guy haha\"",
            "You’d think at 18 you’d have started to hit puberty.",
            "18\"m\"",
            "Dye your hair blonde and you can go as Ellen Degeneres for Halloween.",
            "Tim Dillon’s less funny, more gay little brother.",
            "I bet your desk is covered in monster energy drinks and sticky tissues",
            "Marylin Manson from wish",
            "On the next episode of To Catch A Predator.",
            "You've gotta be careful. Now they can try you as an adult."
        ]
    },
    {
        "title": "Halloween, I'm narcissa, easy costume cause I already had the hair. Roast me",
        "comments": [
            "Rejected Disney princess, Bell’s Palsy.",
            "Are you allowed to drive after having a stroke?",
            "That nostril looks like you’ve been picking it with a log",
            "She'll absolutely have some ectoplasm on the back of her throat tonight.",
            "Next Halloween, please do everyone a favor and pick a costume that covers your face.",
            "Your face is a work of art, like something Picasso might paint.\n\nSeriously, which side was the stroke on, I can't figure out which side suffered the paralysis and which one didn't.",
            "You look like you could snort a balling ball through a hose. Cocaine hides when you walk by.",
            "Do not want to roast you. You are pretty. Do not even need a makeup. Just need some plastic surgery.",
            "Good God, all you need is a monocle 🧐 \n\nYou look like the fucking planters peanut guy.",
            "Did a good job getting rid of your beard.",
            "How much for just a hummer?",
            "You’ve given a handjob under a dinner table, no doubt.",
            "Earnest goes to tramp",
            "Meth is a hell of a drug.",
            "You also already have the face of a 41 year old stripper working at a shitty place near an airport",
            "Since when is resting bitch face a costume?"
        ]
    },
    {
        "title": "Roast me brutally",
        "comments": [
            "You'll need to turn the lights all the way down if you want your ass eaten like that portrait.",
            "I imagine a blowjob from you would constitute as anal.",
            "Voted \"Most likely to win a headbutt competition.\"",
            "Sharonda buys her wall art from Hustler magazine",
            "I bet there’s a well-worn path between your desk and the HR complaints department.",
            "Is somebody eating ass in that picture on the left? I'm expecting OPs account to be NSFW.",
            "I found your Tinder match.\n\n![gif](giphy|Y6yRfR88rvP44)",
            "You got more gums then the underbelly of a high-school desk",
            "Hello Mrs. Ed.",
            "You look roasted enough",
            "Whoopi Copperberg",
            "What was it like being the only non-white person on a company billboard?",
            "Your hairline is trying to distance itself from your face.",
            "Still managed my way into corporate. When you leave the room everyone rolls their eyes and does the actual work the Token hire didn't do",
            "You already busted all the mirrors in your place, now your busting all of the lightbulbs.",
            "You’re hairline is so far back that if you put on some sunglasses you can be Stevie Wonder for Halloween.\n\n![gif](giphy|100SPyKImgpJMQ)",
            "[removed]",
            "I cant tell where your lips end and your gums begin",
            "still managed my way into a quasi- corporate world... =  Stole some of that BLM money for a new home.",
            "From the looks of your wall art, you're just another millennial who likes their ass ate.",
            "Your hairline is trailing the market.",
            "Donkey???",
            "Who let the dogs in?",
            "Your thermostat is on 67... nah girly I ain't roasting you, you're rich rich holding your 401k info pack... you looking for man?  I cook and clean.",
            "What! You're gorgeous, I love how your braids wrap gently around your soft face.. oh shit, you're the thing in front and not the chick getting her ass ate?"
        ]
    },
    {
        "title": "20F. College student and artist. Do your worst or best idk",
        "comments": [
            "20? You look like you just woke up from a Cosby cocktail.",
            "What r u supposed to be? Cracky the genderfluid bunny?",
            "You look like you lost a bet and braided Cheetos into your hair",
            "If MLK had a nightmare",
            "Sure you think the hair makes you edgy and artistic, instead the only emotion evoked is pity",
            "How can you look like you're eight years old yet working on your third divorce?",
            "Jesus fucking christ, your face checks out your username, lady. Get some fucking sleep.",
            "You look like a turtle that hasn’t slept in 27 years",
            "Queen of Sharts",
            "looks like you have been using uppercuts as melatonin",
            "This isn't even your Halloween costume.",
            "“Trick”",
            "You look like the type of woman who can bitch slap someone across the bar.",
            "What have you come as? Donny Hell-no?",
            "This is why i dont go to Starbucks. At least try and look pretty."
        ]
    },
    {
        "title": "24, bored, wearing a shirt that fit a year and a half ago",
        "comments": [
            "Think your sac is infected.",
            "Ironically you’d see the same hairy ass sticking out from behind",
            "bro looks four months pregnant",
            "Looks like your stomach is dressed up as plumber's crack",
            "Goddamn, Halloween brings the Fuckin’ freaks out right?",
            "His belly is full of cum"
        ]
    },
    {
        "title": "My costume is the most interesting thing about me",
        "comments": [
            "🎶Who lives in a pineapple under your pants?🎶\n\nSPONGE BOB SMALL COCK!!",
            "Are you an enlarged prostate?",
            "Is your theme “things I enjoy up my ass”?",
            "Dude is driving around in his white van screaming :\"Are ya ready kids?\"",
            "He says he’s a swinger but actually he just watches his wife get fucked 5x a week.",
            "This guy out there pissing swingers off….",
            "Who lives by himself with no friends for he?\n\nFat blob poop pants!\n\nWho shits in his drawers and smells like fresh pee?\n\nFat blob poop pants!",
            "Was it career day at your girlfriend’s child’s school?",
            "No costume needed to recognize a fruit"
        ]
    },
    {
        "title": "F19. College student procrastinating work. Let it rip.",
        "comments": [
            "It's the same ugly dude who posted that warhammer shit one hour ago, isn't it?",
            "You have the hands of a 56 year old tractor  mechanic named Earl",
            "better be careful masterbaiting with those gollum fingers could puncture your liver",
            "I went to your profile expecting NSFW content, but considering you’re seeking validation on the internet constantly it’s only a matter of time before you make that leap",
            "Miley Vyrus",
            "It's so refreshing to see a girl who doesn't care about her appearances",
            "I bet she has like 4 white claws hidden under the chair she’s sitting on",
            "You look like about an 88% on Mario Party’s ‘Face-Lift’ minigame",
            "Your eyes look as dead as the tree used to make the piece of paper you’re holding.",
            "Your head is so big, it takes you an hour to change your mind.",
            "I've never even met you and i already feel drained. You look like you have very happy ex boyfriends. \n\nYou look like your breakfast consists of a 13$ chia tea and a muffin.  You say you wanted to do art but thats just an excuse because you've never wanted anything besides being a bum. Stop pretending you actually know what you're doing in life and that you'll be a millionaire one day by just working as some waiter",
            "A word of advice, when you inevitably run out of tuition money and have to resort to Only Fans you should be one of those girls who always has her face out of the shot.",
            "Can't tell if ugly or special needs",
            "Finally a girl that is in my league.",
            "Better get to studying. You aren’t hot enough to get a sugar daddy.",
            "I see you decided to dress up as resting bitch face for Halloween.",
            "Dollar tree Alexis Rose",
            "[deleted]",
            "Why the long face?",
            "You look like the Olson sister that they wanted to hide from television.",
            "Your OF would be about average but you’d still make more on that than Whatever you’re studying",
            "Your dimple is cute. Unfortunately it doesn’t make up for the rest of your face.",
            "Stripping isn't really working now, is it??",
            "Yikes… I missed a few things I didn’t see at first. You are the most shot out looking 19 y/o ever. You literally have forehead wrinkles, a thinning hairline, wrinkled dark bags under your eyes and sausage fingers, on some very manly hands that host a series of knuckles the size of Jupiter. You’re going to be very fat in 15 years unless you start taking care now.",
            "Looks like your hand has arthritis from all the hand jobs you’ve been giving",
            "You buy an overpriced cup of coffee everyday and ask yourself ‘why am I poor?’",
            "Love the granny hands.",
            "Those hands made my dick shriveled up inside myself. The roughest sand paper feels better than your lotioned up handjobs.",
            "Cute enough to lack in the personality department… but not cute enough to lack in the personality department.",
            "Yeah I can see you’re not “procrastinating at work” - you liar.   \n\nYou’re actually just farting up the memorial student center because you’re hungover from a Halloween party that you want to as - surprise surprise - Harley fucken Quinn.   \n\nThen you left skidmarks on your fuck-buddy’s sheets and told him you just started your period.  \n\nI went to college. I’ve seen girls like you before."
        ]
    },
    {
        "title": "27M, Textile Designer, doing a 66hrs/week job for literally pennies, Kinda popular woth grils, but really bored with life. Roast me to the ashes, thankYou",
        "comments": [
            "By grils, you mean barbecue's, right?!",
            "I'm sure you have lots of numbers because u have the face of a telemarketer.",
            "Looks like you ride a donkey to work.",
            "Trying to match washcloths and towels does not make you a textile designer.",
            "The personification of spam call"
        ]
    },
    {
        "title": "roast me (nicely??)",
        "comments": [
            "I've never seen someone so ambiguous before. You look like both a 12yo girl and 30yo hippy burnout at the same time. I'm not sure if you're going to invite me to meet Chris Hanson or try sell me some really garbage weed.",
            "Can we first know of you're a 19 year old girl or a 13 year old boy as I'm uncomfortable roasting kids.",
            "Did you do your own stunts as the bat rider in *The Neverending Story*?",
            "You look like a grown up good luck troll doll",
            "Zendayno",
            "You were great in “the Dark Crystal.”  Was it hard to play Skeski #2?",
            "You look like a low budget Nancy Wheeler.",
            "You are definitely in my league.",
            "i cannot tell if you gaslight women or if you like to peg men",
            "![gif](giphy|Wp7qEwWS8sx7KR9Xql|downsized)",
            "This picture reminds me what a great movie Willow was",
            "After a certain age, you should stop with the Mowgli look",
            "I cannot tell your gender, age, race, or species",
            "Yooo you really went on full method acting mode with your poster\n\n![gif](giphy|3ohzdU365DGOdbj5ks)",
            "Your pronouns are it/that",
            "Me: Can we get Zendaya please?!\n\nMom: We have Zendaya at home.\n\nZendaya at home.",
            "If Topo Gigio was a real person.",
            "You look like eep from the croods\n\n![gif](giphy|V6MLyIM5VT6E0)",
            "![gif](giphy|lkO1VbjLZIlEI)",
            "*ANDROGYNY INTENSIFIES*",
            "You are either a 12 yo girl, a single mom who  is a heavy smoker, your local snitch in middle school and finally a 40 year old my little pony fan",
            "I have no idea what you are! Your range is between 13 year old boy and a 40 year old lesbian",
            "Looks like an hermaphrodite mick jegger",
            "r/13or30 that is all",
            "Comeback in 6 years when you are 18.",
            "I thought Rosie Perez died.",
            "Is that the Dark Crystal around your neck?",
            "You look like netflix's new poster boy/girl",
            "Titan that ate Eren's mom",
            "Older than 18 or not, anyone who has sex with you should be legally required to register as a sex offender.",
            "Bro looks like Elliot Paige in a porn parody",
            "You couldn’t look more gender neutral if you tried",
            "You look like the guy from twisted sister",
            "Looks like Donnie Thornberry grew up",
            "You look like you use crystals to treat yeast infections",
            "You look like Tom Holland started watching the office",
            "That's just a Bon Jovi TBT pic 🤔",
            "She/Him/Her/Them/They/it",
            "![gif](giphy|rsUnh0eRhlaY8)",
            "![gif](giphy|l1J9qrAVNHt1bDi2A)\n\nIf I order Dustin from wish.",
            "You're a beautiful young man, but not if you're actually man. In that case you're a beautiful young woman.",
            "My dude(?) can’t even hang a poster straight.",
            "![gif](giphy|l36kU80xPf0ojG0Erg|downsized)\n\nWhen my brother who was my bf:",
            "Eddie Van Gaylen",
            "you look like the gay version of eren with his hair untied.",
            "You look like the fuzzy britches boy from mad max",
            "It's the bare necessities the simple bare necessities!",
            "You look like a protester"
        ]
    },
    {
        "title": "M20, i think, i have some femboy vibes. Roast A.F.",
        "comments": [
            "You look like if Jesus Christ was an atheist and discovered heroin",
            "[deleted]",
            "Not much if a roast but get some fucking sleep you look exhausted.",
            "Didn't I see you outside home depot?",
            "Future medalist in the women's 100m freestyle.",
            "How does it feel knowing your only claims to fame in life are going to be this and being an uncredited extra in the Point Break remake?",
            "You're not supposed to wear white after Labor Day."
        ]
    },
    {
        "title": "20M always wanted to give this a go, don’t hold back, the more brutal, the more hilarious",
        "comments": [
            "you look like a 43-year old divorced dad who won't stop asking his kids about their mom's new boyfriend.",
            "You don’t look a year under 43.",
            "You look like you aren't allowed pets anymore.",
            "![gif](giphy|i1z30bOS4nqbC)\n\nDamn man, you got same body structure as the thumb people from Spy kids but with a neck beard drawn on.",
            "Hodor - The college years",
            "Your posture problems reveal how often you suck in your stomach when in public.",
            "I reckon you'll be found by the police before you see my response but I'll try anyway.\n\nActually, I won't make fun of you. I can only plea with you to let the poor woman go who is taking the photo.",
            "Congratulations on getting chosen to compete in the Special Olympics!",
            "Sir are you touching yourself through that pocket??",
            "Franks and Beans! Franks and Beans!",
            "You're the kind of guy every woman crosses the road to get away from you.",
            "you're 20 and look like you're going through several midlife crises at once",
            "I see Pugsley is getting in on the Halloween fun.",
            "The down’s kid lived to long",
            "If you go into a store and buy alcohol, the cashier will give you a discount.",
            "Hand in pocket and one inch tent in pants. Some girl is about to hit the jackpot",
            "You look like a dirty wall",
            "You might be fat & ugly but at least your dick isn't small right? Maybe someone *might* still love you one day..........MAYBE.",
            "You look like a juco walk on offensive lineman who got cut.",
            "You look like every single guy In an erectile disfunction commercial telling us all about how you found “notarealmansterone.”"
        ]
    },
    {
        "title": "I grew this moustache for a Halloween costume and I hate it. No more fucks given.",
        "comments": [
            "What were you going as, Earthworm Jim?",
            "You look like you drive a 94 Mitsubishi covered in hentai.",
            "Meep meep meep",
            "If real life beaker from the muppets had weak skin",
            "Smashing!",
            "“I’m a nerd, but I like the gym.” Translation: “I don’t work out, but I’ll follow you all the way to your place from the gym.”",
            "This picture should get you put on a list",
            "![gif](giphy|ph8t8u5bErf56)",
            "No more fucks received",
            "Is your Halloween costume going around to your neighbors and having them sign off on your sexual predator registration so your community is aware of you?\n\nIf so, 10/10 for costume.",
            "“I like the gym”\n\nDo you like going to watch young gals in tights? Sure ain’t goin to lift weights.",
            "Smashing!\n\nEdit:  Missed that someone had beaten me to it",
            "It's like the O'Briens threw away Conan and raised the afterbirth",
            "Nigel Thornberry lives!",
            "This is what happens to the cheeto that you dropped between your seat and the center console while trying to eat and drive at the same time during rush hour...after you leave it there for exactly 5 months of not cleaning out your car during the hot, muggy aummer months in Atlanta...you absolute SLOB."
        ]
    },
    {
        "title": "Doing this for the fun of it and the LOLs. Give me your most savage roasts!",
        "comments": [
            "This Gen Z Indiana Jones remake looks fucking awful.",
            "You've been hit by a Simp Criminal",
            "Yo really nice of that hotel to give the homeless a free room for the night. How wholesome.",
            "Jack White Trash",
            "That’s the smile of a guy who knows he’ll NEVER have to worry about catching an STI.",
            "![gif](giphy|PK7IAHdB0l9mg)\n\nJust missing the shades",
            "You look like a Private Eye that specializes in sex doll related crimes.",
            "You make me think that leather diapers could actually have a market.",
            "Jerry's Kid Rock",
            "This isn’t the nice guys, neck beard board. But since you asked, your hat brings shame to your family."
        ]
    },
    {
        "title": "27M, my Girlfriend left me, I totaled my car by hitting a deer and living in a new city where I know no one else in a job that I don't enjoy. Give it to me worse than life has already",
        "comments": [
            "This is the guy that if he shows up at a bar with an acoustic guitar people head to the doors as if the place is on fire.",
            "That man bun looks like a prison joystick",
            "You are a grand menagerie of all the douchey fashion trends of the last 10 years",
            "Pretty sure the deer saw that manbun and committed suicide",
            "Is the job you hate doing straight porn?",
            "You look like a Great Value Joseph Seed.",
            "Is this the picture of your girlfriend or you?",
            "Ok, please just tell us where you buried your gf",
            "At least Jeffrey Dahmer could still hook up on the reg while wearing those glasses.",
            "You look like Adam Lambert’s pap smear.",
            "This guy bought the whole gen z starter pack. Nonsense tattoos and all, even went for the man bun upgrade.",
            "A dude with a man bun got dumped?  Shocker.",
            "God definitely based your fingers off of the thumb people in spykids",
            "The man bun. The stretched ears. The bad tattoos… you sir have done it to your self. You are the trifecta for a new to town person. \nUnfuckable\nUnhireable if you leave your gig\nAnd worst of all. Based on your profile. You probably have bad credit",
            "Just give me my venti latte already",
            "First glance suggests you brought this on yourself",
            "Flower tattoos? You uncreative bastard.",
            "Out of all the options available you thought to yourself “maybe I should go with the Jeffrey Dahmer glasses frames.” I guess at least your winning decision making abilities are consistent…",
            "You and your ex are both better off seeing other men. You look like most of the 64 mental disorders.",
            "If it gets any worse, at least you will always be able to look at the cherry blossoms on your arm for comfort.",
            "Jeffery Duhmber",
            "Date the blind... I think it's for the best.",
            "Fake prescription glasses, man bun, nose pierced, stretched ears.. All I see is a cluster-fuck of attempts to seem hip and cool. Also it's a shame you wasted $ on that hentai backdrop looking tattoo, probably would've been better spent paying your insurance deductible on the totaled car",
            "Well you look the part for someone who's about to give up on life. Last time I saw that facial expression and hair bun was on the secretary in my high school.",
            "Tats, facial hair, gauged ears, man bun, retro glasses. You look like you just jump on every douche fad and never drop any of them. That's probably an Ed Hardy t-shirt behind the sign.\n\nEdit: forgot the noise ring.",
            "Even your tats are fading so they don’t have to be associated with you anymore",
            "Sorry you lost your job as a fact checker at Twitter. Elon has a distaste for man buns and bad tattoos.",
            "Got a face worse than the car you totaled.",
            "You've got nice ink, but you maybe need to consider a face tattoo to improve your looks. Maybe a tramp stamp like Tyson. Fuck, anything's got to help. If you don't want to do that, just rub your face in shit. You'll still be ugly but the poo will cover it up some.",
            "Shit malone\n\n![gif](giphy|l1KtXgl2Bv6Wp9cfC)",
            "She was sick of doing yoga and eating vegan"
        ]
    },
    {
        "title": "23 years old, living in turkey. Smokes 2 pacs of cigarettes a day. Tourist guide. Do your worst reddit!!!",
        "comments": [
            "You're like fonzie from \"Happy Days\" except when you walk in a room you say gaaaaaaaay",
            "I guess cigarettes is Turkish slang for dicks?",
            "You look like a street magician who specializes in making young women on student visas disappear.",
            "Preying on tourists until they're so uncomfortable they pay you to fuck off doesn't make you a tour guide, sorry buddy.",
            "AIDS is a 2:1 favorite over lung cancer.",
            "Sucking tourists off in a gloryhole doesn't make you a tourist guide.",
            "buddy 2 packs a day is normal here in Türkiye. just say light smoker. it's enough.",
            "You look like you waste people's time for a living",
            "Who waxes your eyebrows?",
            "U look like the unwanted CIA agent and immediately got deppresed and started to do drugs after",
            "Ironic, since 2pac would smoke you on sight.  (And we'd all cheer him on!)",
            "Let’s see if we can get that up to 4 packs a day pussy",
            "I can smell you through the picture.",
            "23 smokes 2 packs a day, enjoy your disease filled shortened life",
            "Dicks. Smokes 2 DICKS a day .",
            "![gif](giphy|1ykhXVZskuM6cpBMlG|downsized)",
            "I want to roast you, but I'm stuck on the fact that Turkey needs tour guides."
        ]
    },
    {
        "title": "M18 2 years on Reddit now. Make me regret joining this community",
        "comments": [
            "You look like you rotate between 6 different pronouns from week to week",
            "Male?   Are you sure?",
            "your fucking nose almost broke through my phone screen",
            "on the behalf of community we regret to have you",
            "At first I thought you were a very masculine looking girl. Now I find you to be a barely masculine looking guy.",
            "How dare you assume your gender",
            "FTM?",
            "You didn't regret joining reddit when they wouldn't verify you on r/traps ?",
            "makes both males and females vaguely uncomfortable",
            "How big are your tits.",
            "I loved you in *The Wedding Singer*",
            "I’m surprised that you’re still alive in Russia! I thought they would have at least put in jail for being trans. But damn you got a lot of incest memes on your page, that makes the people in Alabama (Southern United States) jealous.",
            "Pre op or post op?"
        ]
    },
    {
        "title": "I'll give you something easy",
        "comments": [
            "It’s Pat!",
            "It's cool you still live in the same room you never lost your virginity in",
            "You're a virgin across the multiverse, in every reality past present and future",
            "Don't you have to be a minimum of 15 to be roasted?  Come back if your balls ever drop.",
            "Thurman Merman",
            "![gif](giphy|vTJNXksu9NwKk)",
            "Nice jacket, didn't know diabetes had a varsity team.",
            "You look like Kick Ass if his special ability was pudding.",
            "Umm you have to be 18 to be on here.",
            "Johan Hill’s less successful brother Ova",
            "Is that what you said to the priest ?",
            "You know you're supposed to be over 18 to post here right. Don't let mom and dad know or you'll lose your good boy points.",
            "Idk what's more hideous, your ugly ass face or those abhorrent 2 year old drawings on the wall...\n\nGuess your mom even knew they were to fucking ugly to put on the fridge.",
            "why are you holding the paper like that ?"
        ]
    },
    {
        "title": "👍",
        "comments": [
            "Not even the TV you crawled out off wants you back.",
            "You look like you say \"I'm not like other girls\" at least once a day\n\nto your cat",
            "Can we get a fucking jump scare warning next time?",
            "Holy shit, I didn’t think the Momo Challenge was real!",
            "Monday Adams.",
            "Not sure why Bluto is always trying to steal you from Popeye . . .",
            "The Devil Wears Goodwill",
            "[removed]",
            "![gif](giphy|HO5HilczK50Ws)",
            "🖕",
            "My new sleep paralysis demon.",
            "You look like an ugly girl pretending to be cute thats doing an impression of an ugly girl trying to be cute.",
            "Was gonna roast you but I’m afraid you’ll slither out of my tv to get revenge.",
            "You look like you pretend to be a lesbian but only because dudes ignore you.",
            "You look like you suck dick for heroin",
            "Are you holding your breath in photo 2 or just trying not to swallow the cum?",
            "Gen Z's remake of Overly Attached Girlfriend is looking really creepy",
            "Icky, icky, bang, bang.",
            "Manic pixie nightmare girl",
            "You look like the girl you pick up for a one night stand that says it’s ok to raw dog it, since you do it all the time.",
            "![gif](giphy|y4tHpq920ifm)",
            "I’m just gonna say this: DONT GO TO THE OVERLOOK HOTEL AT ALL COST!",
            "Tifa Lockharen’t",
            "Grow your bangs about 10 inches longer.",
            "Did the girl from the ring possess a doe eyed woman just so she could feel grown up?"
        ]
    },
    {
        "title": "I've been waiting a while to do this, and I just turned 18. Give me your best roasts!",
        "comments": [
            "You look like you turned 18 three murders ago.",
            "You look like one of Ron Jeremy’s mistakes.",
            "If you just turned 18 your 30’s are going to suck.",
            "The mustache DEFINITELY makes you look less creepy.",
            "So…\n\n\n…are they buried under your porch or in a mass shallow grave in the woods behind your house?",
            "Jonathon Davis really went to shit\n\nBeef on a yeesh",
            "You look like Michael Cera and Ron Jeremy beat off into a test tube and you came out 9 months later.",
            "If Jonathan Davis were a professional eater instead of being a musician. \n\nA.D.I.D.A.S(ausage).",
            "You look more like a meatloaf than a roast",
            "Can’t understand why all these “chads” are getting laid and you’re not.",
            "Your forehead looks like someone lawn mowered over an ants nest",
            "Your hair is a handlebar moustache",
            "You have the sex appeal of used dental floss.",
            "You look like you’re 6 going on 40.",
            "Your high school diploma had a \"Remain 500 feet from all educational institutions\" judgement attached to it.",
            "Wrong Jeremy",
            "You look like an androgynous version of Steven Wright.",
            "It doesn't mean what you think bud . It's not the food kind . It's making fun of people.   Not a pot roast.",
            "You look like you molest people older than you.",
            "What type of lesbian do you identify as?",
            "Are you even allowed within 500 feet of your high school?",
            "You're the Ron Jeremy that comes with ordering off of Wish",
            "You look like incel Ron Jeremy."
        ]
    },
    {
        "title": "24F, single, and still working at DQ. Do your worst!",
        "comments": [
            "They source milk on site now?",
            "You just DQ’d me from ever having a boner again.",
            "You didn't need to mention that you are single.  We could infer that from the pic.",
            "Why do you smear the caramel topping on your teeth?",
            "![gif](giphy|0mEhqMCmMTTaxyzygL)",
            "see that girl, watch that scene, working in dairy queen 🎵🎶",
            "Those teeth looks like God used a compass to make them.",
            "This pic reeks of parental disappointment",
            "Who do you work as? A cow?"
        ]
    },
    {
        "title": "23m, employed and not a souncloud rapper, did this a couple years back and it was extremely funny. Lets go another round",
        "comments": [
            "Your mom has a nice kitchen",
            "You know you aren’t allowed in the house.  Please finish trimming the hedges Hector.",
            "Get a washcloth,  you've got some shit on your face",
            "MS13 recruiting must be desperate",
            "Mario’s youngest brother, Squeegee",
            "Post Alone",
            "Getting in the back of a pick up with 5 other guys at an Ace Hardware isn't exactly \"employment\".",
            "How much for a bag of oranges? Or are you more of the squeegee type of hustler?",
            "You look like you drive a 94 matte black honda civic with lambo doors both gray primer with a red wing and a 5inch exhaust pipe",
            "I’ve seen lesbians with thicker mustaches",
            "\"I'm not a rapper\"",
            "Malibu's least wanted.",
            "So people actually TRY to look like a SoundCloud rapper without actually being a rapper? Yikes, you even make the untalented look talented.",
            "Vote for Pedro",
            "Your face looks like a desk in study hall",
            "That’s the nicest kitchen I’ve ever seen in prison",
            "\"Hey kids, wanna buy some drugs?\" looking ass",
            "Hey man, could you just fix my sink and go on your way??",
            "[deleted]",
            "Milque-toast Malone"
        ]
    },
    {
        "title": "It has been 2 years since I've used this reddit account, 2 years since I posted on R/Roast me. Quick summery of the past 2 years, fionce left me, nearly had 3 kids, got a new girlfriend, dad came back into my life but mom has written me off, I never finished my studies and moved to a new house.",
        "comments": [
            "All that tragedy, and yet you still kept that haircut.",
            "Your \"fionce\" left you because you ignant.",
            "Simon Pegged",
            "Dad came into your life, or just into you?",
            "Nearly had 3 kids but they said no to the free candy you were offering",
            "Still can't spell",
            "Have you ever thought “maybe it’s me…”?",
            "I knew your whole life story from that haircut.",
            "Beiber changed his hair years ago. Maybe it's time you thought about it.",
            "Seems like you did a good enough job on your own. How do we top that.",
            "Did your mom leave you because you stole all her camera filters?",
            "Basement Sanji",
            "How do you manage to look like a soccer mom, a kid, and a creepy guy driving a white van all at the same time?",
            "You could probably type a more legible headline if you take your cock rings off your fingers."
        ]
    },
    {
        "title": "(18M) I am ready to be roasted",
        "comments": [
            "Holy fuck... the black npc from wii bowling has escaped the game into real life. Who do we need to call in this situation... Ghostbusters maybe? 🤷‍♂️",
            "You look like if Hannibal Buress fucked Steve Urkel.",
            "This pic was clearly taken in a closet and that’s where you should stay until you’re comfortable.",
            "Wanda Sykes now identifies as male?",
            "Your hairline is what they used to teach y=ax^2+bx+c",
            "Awww its Sid the science kid all grown up",
            "Chocolate rain\nSome say I have a lazy eye\nChocolate rain\nI look like I huff glue meant for aero planes",
            "You look like unsuccessful attempt to draw Whoopi Goldberg.",
            "Roasted? Looks like you are already burnt.",
            "How do you roast charcoal?",
            "How many push ups can you do with that baby arm",
            "Where the fudge is my door dash??!",
            "Shave that dirt off of your chin you look like you taking hormones",
            "Look it's Mr. Potato Head.",
            "Who ordered the dark meat?"
        ]
    },
    {
        "title": "21M, do your worst. Let's see if you can hurt me more than my migraines do.",
        "comments": [
            "This is what happens if you raise Thor in Florida.",
            "Kurt Cocaine",
            "Definitely the kind of guy to take the condom off mid sex and not tell him.",
            "You couldn't even get fucked by a blind chick. The acne on your face is Braille for \"unfuckable\".",
            "the migraines might go away if you stop doing meth",
            "Migraine implies the presence of a brain. Don’t confuse it with your skull pain.",
            "Roast you? I tend to bake my pizza.....",
            "Master of Muppets.  \n\nNot that anyone should be trying to create your vibe, but you're fucking it up even further with that bling bracelet, bro",
            "I can’t imagine how bad your migraines must be for them to be your biggest problem",
            "Did your grandma buy you “how to be in a rock band, the dummy’s guide”? You’re ticking all the boxes except one:\n- Greasy long hair ✔️\n- Chin whiskers that look like ball hair ✔️\n- Chains for your neck and wrist ✔️\n- Stupid glare like Charles Manson ✔️\n- Talent ❌",
            "How’s your “band” doing?",
            "They are called thoughts not migraines bud..",
            "Mettardica",
            "You look like Varg Vikernes after prison",
            "Migraines are your brain trying to leave that body",
            "If power bottom at a rest stop glory hole had a face.",
            "Bob Zombie",
            "Mad-Eye Broody",
            "I've seen foreheads. I've seen five heads. I've never seen a two head until now.",
            "Ugly Osbourne",
            "Thor: Crack and Thunder",
            "21 looking 41. Lay off the Meth.",
            "Your face is giving me a migraine",
            "Judging by the craters on your face, youve been protecting humanity from meteorites for centuries. Thank you for your service to the human race.",
            "The long hair and beard are great but the acne is what really makes it pop",
            "Master of Sock Puppets or Skid-mark Row.",
            "Ohio thor",
            "Bro. Is that a high school bathroom?",
            "Shit, you know what wouldn’t hurt? Some FACEWASH.",
            "Seriously though have you tried shrooms for migraine. Changed a friend's life",
            "Migranes and long hair, are you sure you're not a woman?",
            "I like you better in your cool fedora and red/green sweater, Mr. Krueger.",
            "[Wish.com](https://Wish.com) James Hetfield"
        ]
    },
    {
        "title": "Both Italian 18 Males (STRAIGHT)",
        "comments": [
            "Thanks for prefacing that you're straight. It just makes it more clear that you are probably gay and don't know it yet.",
            "I feel like that's your girlfriend on the right and you did a face swap.",
            "I bet at least 2 of you are not straight",
            "Straight to the glory hole.",
            "(FALSE)",
            "The church is now reconsideing its stance on Abortion amd contraception.",
            "STRAIGHT like ROTINI",
            "You're trying too hard to convince us",
            "(DOUBT)",
            "We are not your parents. You don’t have to convince us that you’re straight and/or males.",
            "*rolls dice* sorry, you are both lovers.",
            "You could fry a chicken with the grease in this photo",
            "I dont think straight is the right word. Must have been lost in translation.",
            "Romulus and Remus that we deserve",
            "You two are about as straight as an Elton John musical.",
            "Ah yes, Penis and Butt-spread. An Italian cartoon by Mike Judge.",
            "A troglodyte, frozen in the ice for 40,000 years, and the sherpa who found him.",
            "Gay and silent slob",
            "Ladies and gentlemen! I present to you!\n\nBiggus Dickus, and his wife.... Incontinentia....\n\nIncontinentia Buttocks",
            "Both in denial..",
            "Gay porno mashup of Cobra Kai and Stranger Things. \n\n\"My trouser snake strikes hard!\"\n\n\"I've seen a stranger's thing.\""
        ]
    },
    {
        "title": "Do your best/worst.",
        "comments": [
            "Now is the time on Sprockets when we dance",
            "Kind of look like you’re expecting Mr.Bond to die…",
            "Waiting like a stalking butler 🎶"
        ]
    },
    {
        "title": "18M with low self-esteem, Do your best",
        "comments": [
            "Looks like you also have Low Testosterone and undescended testicles.",
            "my blind friend is complaining about your looks.",
            "\"18M with low self-esteem\"\n\nIt can and should go lower.",
            "You have correct self-esteem",
            "Maybe if you didn’t look like you had the personality of a cum sock that’s been lost under the bed for six months, you wouldn’t have low self esteem.",
            "How are your glasses straight but your eyes aren't lmao",
            "Bitches love the neck beards.",
            "I’d make a friend zone joke, but.. you’re not there, are you?",
            "More like 18Months pregnant.",
            "When your clothes match the wall behind you thats a panty dropper for sure."
        ]
    },
    {
        "title": "M24 lost in fantasy football. Please don’t hold back",
        "comments": [
            "You look like you collect restraining orders.",
            "Wow your boy scout troop leader wrecked your ears using them as handlebars.",
            "You look like Goose from Top Gun if he skipped the military and decided to follow kids around in a big white van all day.",
            "You look like the first openly gay cop in Akron Ohio.",
            "Age: 24, look:42, vibe: that uncle you're not suposed to be left alone with.",
            "The Restraining Order says to stay 500 yards from the Dog Park.",
            "Football might be your fantasy but guys kicking in your balls with their foot on a daily basis is your reality",
            " You look like you say \"Ta-Dah!\" way too often",
            "Lost in fantasy, lost in reality",
            "You look like you know all the Gatorades by flavor and not color.. in other words, a cop."
        ]
    },
    {
        "title": "Took 4 years to graduate community college and is chronically late to work. Actually try to roast me.",
        "comments": [
            "No, I don't want to hear your thoughts on the Marvel cinematic universe.",
            "You look like the kind of guy that walks around in public wearing sweat pants with jizz stains on them",
            "Those sausage fingers must be handy during those lonely nights",
            "Holy hell, save some pussy for the rest of us",
            "This is what you get if you order Seth Rogan from wish."
        ]
    },
    {
        "title": "Hit me",
        "comments": [
            "I want to literally hit you",
            "You look like if you work really hard, buckle down and really improve your grades, you just might have a shot at someday not fucking up my Burger King order twice in a row.",
            "You look like you regularly go back to visit your middle school parking lot to start fights.",
            "You look like a gayer Kyle Rittenhouse",
            "You look like you understand youre in special ed",
            "You look like you patrol your neighborhood harassing minorities",
            "No. There're laws against assaulting the disabled.",
            "You look like you collect your boogers and toe nails in coffee cans.",
            "You look like TikTok Hitler",
            "Youve already been hit by every branch on the ugly tree. It was a long fall down too.",
            "Like Danny McBride and honey boo boo had a love child.",
            "You look like you're impersonating the one girl you've had sex with",
            "I think you lost a chromosome or two",
            "Your face looks zoomed out but your head isn't",
            "Wow.. 4 hours, not a single taker.. \n\nYou look like the son of the singer in a nu metal band."
        ]
    },
    {
        "title": "Do your worst",
        "comments": [
            "Don’t need to do my worst, your hair dresser did it for me.",
            "Your complexion makes the tuna salad look healthy and delicious.",
            "It's going to take a foot long Xanax for me to forget looking at you.",
            "![gif](giphy|fu29AimM298PK)",
            "You look like a rejected extra from Gummo.",
            "Having you touch my food feels like an FDA violation.",
            "I’ll bet Quizno’s hired you to stand in front of Subway to drive away customers.",
            "I’m sure your pronoun is weeble.",
            "Jared is the root of your mental health issues.",
            "Only she can make a 6\" into a 2\".",
            "The smell of subway bread haunts you; it has become your natural musk.",
            "Your definitely best suited for a job in that back room. Where the customers will not see you.",
            "Is it possible to break your nose giving a blowjob? I guess you found a way",
            "When you make a sub, the customer can taste your parents disappointment",
            "You’re built like a bowling pin",
            "Hey, can I have a foot long meatball sub? I’d like onions, peppers, self respect, dignity, a few slices of potential and some hope for the future. Oh? You’re completely out? Should’ve seen that coming…",
            "Benny the bull fucked a tangerine then...",
            "People are a lot like sandwiches - different ingredients coming together to create something interesting and flavorful. You just look like a shit sandwich.",
            "r/awfuleverything r/justfuckmyshitup",
            "Even Jared wouldn't sleep with you.",
            "The band aid is not covering the track marks.",
            "Quite the look you have, most people can’t balance radiating pity and disgust but you nailed it.",
            "If I answer your questions three, do I get a hot topic gift card?",
            "This is the first time I’ve ever seen someone with a pierced asshole.",
            "You are the physical embodiment of \"doing your worst.\"",
            "Where is Rocksteady?",
            "If you were the \"sandwich artist\" on duty I would seriously turn around and walk out.",
            "SUBWAY: Where you not only question if the bread is bread or the tuna is tuna, but also where you question the gender of your sandwich artist. \n\nLook like you belong in the human terrarium in Solar Opposites.",
            "Life already has.",
            "You may pierce your face but you’ll never be able to pierce the heart of the dad that left you",
            "You: Wished to handle 6\" and footlongs all day and get paid!\n\nGenie: I got ya",
            "Great, now Hakuna Matata is stuck in my head, because in some strange way you remind me of Pumbaa",
            "The next Democratic Party Nomination for President!"
        ]
    },
    {
        "title": "Roast me 28yo",
        "comments": [
            "nothing in this image but beige,  yall see a person?",
            "I bet when you sneeze through those nostrils you do a back flip whether you want to or not",
            "I'm a Muslim, and if I bought you back to my house to share with my friends, they'd beat me up because pork isn't allowed in the house.",
            "With those nostrils you could lead the Harmonic Symphony Orchestra!",
            "Your face is the reason why certain cultures don’t allow women to show their faces in public.",
            "You are the human embodiment of a turtle head poking out.",
            "This looks like every CVS pharmacist I’ve ever spoken with.",
            "You look like a sperm bank office manager who occasionally grabs a taste of the goods.",
            "Are you on Arthur?",
            "I never understood why some Indian men fuck goats, then I saw you.",
            "I can tell youre a mouth breather. Your lips have their own nostrils",
            "Do you also love hay and carrots?"
        ]
    }
]