[
    {
        "dialog_id": "test-1",
        "post": "Elon Musk: And we just hit another all-time high in Twitter usage lol",
        "response": "DEMO ONLY",
        "wiki_knowledge": [
            "from secondary sources or in available primary documentation of the gun's existence prior to the publication of Lake's book. After its publication, various Colt revolvers with long (10-inch or 16-inch) barrels were called Colt Buntlines or Buntline Specials. Colt manufactured the pistol among its second-generation revolvers produced after 1956. A number of other manufacturers, such as Uberti, Navy Arms, and Cimarron Arms, have made their own versions of this long-barreled revolver. The revolver was first described by Stuart Lake in his highly fictionalized 1931 biography \"\". The extremely popular book turned Wyatt Earp into a \"Western superman\". Lake's creative biography",
            "while only 9% reported an unfavorable view. Even two months later, in early October 2004, FDU's poll release entitled \"Richard Who?\" found that, despite that Codey would soon take over as governor from McGreevey, the name \"Richard Codey\" remained unknown to 59% of New Jersey voters. However, voters who knew him held distinctly more favorable than unfavorable views by a two to one ratio, (23%–10%). By early January 2005, when PublicMind again conducted a statewide study in which voters were asked: \"Have you heard of Richard Codey?,\" the numbers showed that 35% of New Jersey voters still did not recognize",
            "Contour line A contour line (also isoline, isopleth, or isarithm) of a function of two variables is a curve along which the function has a constant value, so that the curve joins points of equal value. It is a plane section of the three-dimensional graph of the function \"f\"(\"x\", \"y\") parallel to the \"x\", \"y\" plane. In cartography, a contour line (often just called a \"contour\") joins points of equal elevation (height) above a given level, such as mean sea level. A contour map is a map illustrated with contour lines, for example a topographic map, which thus shows valleys",
            "to a mountain, where they witnessed the rock miraculously split open, revealing the camel. The she-camel had a young calf. Saleh informed the Thamud that the older camel was to drink from their water source on one day, and they were to drink from it the next day. On days when they were not allowed to drink water, the camel provided them with milk. But God informed Saleh that a boy who would hamstring the camel would soon be born to the tribe, and that child was evil and grew unnaturally fast. The camel was indeed killed, and its calf",
            "and a native of Beccles. A fire in 1659 devastated most of the town and damaged St Edmund's Church, whose original structure dated from the 12th century. The fire created a number of open spaces within the town which were never rebuilt. Today this \"series of varied and very delightful village greens\" and the restriction of expansion because of the surrounding marshes, have preserved the town's genteel appearance. On the green just above the beach, descriptively named Gun Hill, the six 18-pounder cannon commemorate the Battle of Sole Bay, fought in 1672 between English and French fleets on one side"
        ],
        "wiki_knowledge_title": [
            "\"Colt Buntline\"",
            "\"Richard Codey\"",
            "\"Contour line\"",
            "Saleh",
            "Southwold"
        ],
        "wiki_knowledge_score": [
            93.13848114013672,
            87.06976318359375,
            85.21080780029297,
            85.13128662109375,
            84.17849731445312
        ],
        "reddit_knowledge": [
            "And you're contributing to it by posting this - so clearly you're awesome!",
            "Omg please share your skin care regimen with us! You are glowing! ",
            "Omg you are the perfect combination of edgy and glam. I love it!! Gorgeous. Congratulations!! ",
            "This is my first comment in this sub. I think you are awesome!",
            "And you are my new favorite person on the Internet!"
        ],
        "reddit_knowledge_title": [
            "",
            "",
            "",
            "",
            ""
        ],
        "reddit_knowledge_score": [
            108.52159118652344,
            107.68605041503906,
            106.68727111816406,
            106.49480438232422,
            106.48143768310547
        ]
    },
    {
        "dialog_id": "test-2",
        "post": "Elon Musk: Thanksgiving cuisine is such a delightful symphony of flavor!",
        "response": "DEMO ONLY",
        "wiki_knowledge": [
            "Chile, and other ports; he served on different departmental committees, notably that of 1894–96 on the Mercantile Marine Fund. Monkhouse was twice married: first, to Laura, daughter of James Keymer of Dartford; and, secondly, to Leonora Eliza, daughter of Commander Blount, R.N. Cosmo Monkhouse was one of those who not only have a vocation, but an avocation. Cosmo's first bias was to poetry, and in 1865 he issued \"A Dream of Idleness and Other Poems,\" a collection strongly coloured by his admiration for Wordsworth and Tennyson. It was marked by exceptional maturity, and scarcely received the recognition it deserved. Perhaps",
            "while only 9% reported an unfavorable view. Even two months later, in early October 2004, FDU's poll release entitled \"Richard Who?\" found that, despite that Codey would soon take over as governor from McGreevey, the name \"Richard Codey\" remained unknown to 59% of New Jersey voters. However, voters who knew him held distinctly more favorable than unfavorable views by a two to one ratio, (23%–10%). By early January 2005, when PublicMind again conducted a statewide study in which voters were asked: \"Have you heard of Richard Codey?,\" the numbers showed that 35% of New Jersey voters still did not recognize",
            "was published in 1970 to wide critical acclaim. Between 1970 and his death, he published nearly a dozen additional books, including four novels. He held visiting lectureships, fellowships and professorships at several institutions, including the Columbia University Graduate School of Journalism (1968), Colgate University (1970; 1973; 1982), the University of Massachusetts Boston (1971), the University of Missouri (1972), Emory University (1978), Drew University (1983) and Washington and Lee University (1993). From 1981 to 1983, he was an adjunct associate professor of writing at Barnard College. In 1976, he received the prestigious ASCAP-Deems Taylor Award for his music criticism. He also",
            "visited the Ming capital Nanjing in 1408 and died there; his tomb was rediscovered in the 20th century, and is now a protected monument. The greater part of the official historical record for early Brunei until the arrival of Pigafetta is based on legends and assumptions. The historical account – lacking any real evidence – has been constructed in such a way that around 1370, Zhu Yuan Zhang sent representatives to Brunei via Indonesia, and Brunei paid tribute to the Ming Chinese. This signified the strong influence of the Ming Dynasty, and accounts for the combination of Ong Sum Ping's",
            "successful 11-day mission at 9:54 am. The five stars on the left and nine stars on the right of the insignia symbolize the flight's numerical designation in the Space Transportation System's mission sequence. STS-59 STS-59 Shuttle mission was a Space Shuttle program mission that took place in 1994. The launch was chronicled by the 1994 Discovery Channel special about the Space Shuttle Program. \"Endeavour\" began its sixth mission on the morning of 9 April 1994 with an on-time launch at 7:05 am Eastern time. Soon after, the six astronauts began activating the sensitive radar equipment in the payload bay that"
        ],
        "wiki_knowledge_title": [
            "\"William Cosmo Monkhouse\"",
            "\"Richard Codey\"",
            "\"Albert Murray (writer)\"",
            "\"History of Brunei\"",
            "STS-59"
        ],
        "wiki_knowledge_score": [
            98.49165344238281,
            95.91219329833984,
            89.95928192138672,
            86.97560119628906,
            84.5249252319336
        ],
        "reddit_knowledge": [
            "Mmmm I love me some cookies and they look incredible",
            "Your pumpkin is sweet! I haven’t dressed up in yeaaars. The last time I did I was a pumpkin to!",
            "Super cute! Floral is timeless<3",
            "That is awesome!  I love it! You Etsy store looks great! ",
            "Sorry I’m so late to the party, but as someone who loves to snuggle up to my loving furry sweet Frenchie (French Bulldog) when I’m in need of a little sunshine and hopefulness again (everyday all day it seems like lately!) I LOVE that you have such an awesome totally unique, equally loving (I’m sure!) little creature to cheer you up, too! Sending you both snuggly and, equally chill, scaly uplifting thoughts from myself and the little furry face right next to me!  "
        ],
        "reddit_knowledge_title": [
            "",
            "",
            "",
            "",
            ""
        ],
        "reddit_knowledge_score": [
            113.24898529052734,
            109.22885131835938,
            108.90440368652344,
            106.97264099121094,
            106.97039794921875
        ]
    },
    {
        "dialog_id": "test-3",
        "post": "Elon Musk: Going forward, accounts engaged in parody must include \"parody\" in their name, not just in bio",
        "response": "DEMO ONLY",
        "wiki_knowledge": [
            "washed away, and the water tower was knocked down. A report by the State indicated that roughly 285 people in Mexico Beach had declined to evacuate the area, although some of those may have left before the peak of the storm. The death toll had not be determined as of October 12, but Brock Long of FEMA was not optimistic: \"Very few people live to tell what it's like to experience storm surge, and unfortunately in this country we seem to not learn the lesson\". At that time, Mayor Al Cathey told residents it might be months before electricity, water,",
            "Contour line A contour line (also isoline, isopleth, or isarithm) of a function of two variables is a curve along which the function has a constant value, so that the curve joins points of equal value. It is a plane section of the three-dimensional graph of the function \"f\"(\"x\", \"y\") parallel to the \"x\", \"y\" plane. In cartography, a contour line (often just called a \"contour\") joins points of equal elevation (height) above a given level, such as mean sea level. A contour map is a map illustrated with contour lines, for example a topographic map, which thus shows valleys",
            "is a marginal distribution. Suppose that the goal is to estimate P(E) for E on the tail of P(E). Formally, P(E) can be written as and, thus, estimating P(E) can be accomplished by estimating the expected value of the indicator function formula_82, which is 1 when formula_83 and zero otherwise. Because E is on the tail of P(E), the probability to draw a state x with E(x) on the tail of P(E) is proportional to P(E), which is small by definition. Metropolis-Hastings can be used here to sample (rare) states more likely and thus increase the number of samples used",
            "divorced in May 1996. Yates later moved in with Hutchence, and had a daughter with him. Hutchence committed suicide in a hotel room on 22 November 1997. After Hutchence's death, Geldof and Yates each gave police statements on the phone calls they exchanged with Hutchence that morning but did not volunteer their phone records. Yates' statement on 26 November included \"He was frightened and couldn't stand a minute more without his baby ... [he] was terribly upset and he said, 'I don't know how I'll live without seeing Tiger.'\" Yates contended that Geldof had repeatedly said, \"Don't forget, I am",
            "2.44 and the average family size was 2.93. In the CDP, the population was spread out with 27.4% under the age of 18, 4.2% from 18 to 24, 32.6% from 25 to 44, 22.1% from 45 to 64, and 13.7% who were 65 years of age or older. The median age was 38 years. For every 100 females, there were 111.1 males. For every 100 females age 18 and over, there were 97.1 males. The median income for a household in the CDP was $48,654, and the median income for a family was $48,654. Males had a median income of"
        ],
        "wiki_knowledge_title": [
            "\"Mexico Beach, Florida\"",
            "\"Contour line\"",
            "\"Metropolis–Hastings algorithm\"",
            "\"Bob Geldof\"",
            "\"Cundiyo, New Mexico\""
        ],
        "wiki_knowledge_score": [
            98.62767028808594,
            94.38645935058594,
            94.36480712890625,
            91.97604370117188,
            91.736328125
        ],
        "reddit_knowledge": [
            "I mean, the roast me subreddit is supposed to be a fun, comedic thing. If you actually feel a certain kind of way about yourself don't post there.\n\nThey literally look for anything to roast you because that's the point of the sub. I wouldn't take those roasts seriously, because it's often exaggerated for humor.",
            "Some people are douches here on Reddit. However, I think the bald look goes rather well with you. I like it! And it looks good on you too. Don't pay too much attention to the negative people on here, they light to act like they're high and mighty above everyone else. ",
            "That just means you have an excuse to build a bigger and even better beard than before! Plus the ability to brag amount the **numerous** epic beards you’ve had in your life!!!\n\nThe great news is your barber might have dun goofed, but your hair looks so sharp! As someone with garbage hair, I’m jealous! Keep rocking the great hair vibes, whether it’s on your scalp or your face. :) ",
            "I am so jealous of that beard dude, its awesome. And you can always play up to it, like just claim you can't hear them when they ask something? That's what i do when someone mocks mine ",
            "Commenters on amifat are those awful redditors who call gorgeous people 6.5's and say healthy people are fat.\n\n\nWhat they say is biased and wrong. Disregard what they would say. \n\n\n\nKeep up the great work!!"
        ],
        "reddit_knowledge_title": [
            "",
            "",
            "",
            "",
            ""
        ],
        "reddit_knowledge_score": [
            108.76171875,
            107.56076049804688,
            106.94490051269531,
            105.87725830078125,
            105.36283874511719
        ]
    },
    {
        "dialog_id": "test-4",
        "post": "Elon Musk: Btw, I'd like to apologize for Twitter being super slow in many countries. App is doing >1000 poorly batched RPCs just to render a home timeline!",
        "response": "DEMO ONLY",
        "wiki_knowledge": [
            "is a marginal distribution. Suppose that the goal is to estimate P(E) for E on the tail of P(E). Formally, P(E) can be written as and, thus, estimating P(E) can be accomplished by estimating the expected value of the indicator function formula_82, which is 1 when formula_83 and zero otherwise. Because E is on the tail of P(E), the probability to draw a state x with E(x) on the tail of P(E) is proportional to P(E), which is small by definition. Metropolis-Hastings can be used here to sample (rare) states more likely and thus increase the number of samples used",
            "and Alexander Semin. The Capitals' 2005 off-season consisted of making D.C.-area native Halpern the team's captain, signing Andrew Cassels, Ben Clymer, Mathieu Biron and Jamie Heward, and acquiring Chris Clark and Jeff Friesen via trade. The Capitals finished the 2005–06 season in the cellar of the Southeastern Division again, with a 29–41–12 campaign, earning 12 more points than the 2003–04 season, good for 27th out of the 30 NHL teams. The team, however, played close in every game, playing in 42 one-goal games, although losing two-thirds of those games. Ovechkin's rookie season exceeded the hype, as he led all 2005–06",
            "Contour line A contour line (also isoline, isopleth, or isarithm) of a function of two variables is a curve along which the function has a constant value, so that the curve joins points of equal value. It is a plane section of the three-dimensional graph of the function \"f\"(\"x\", \"y\") parallel to the \"x\", \"y\" plane. In cartography, a contour line (often just called a \"contour\") joins points of equal elevation (height) above a given level, such as mean sea level. A contour map is a map illustrated with contour lines, for example a topographic map, which thus shows valleys",
            "from secondary sources or in available primary documentation of the gun's existence prior to the publication of Lake's book. After its publication, various Colt revolvers with long (10-inch or 16-inch) barrels were called Colt Buntlines or Buntline Specials. Colt manufactured the pistol among its second-generation revolvers produced after 1956. A number of other manufacturers, such as Uberti, Navy Arms, and Cimarron Arms, have made their own versions of this long-barreled revolver. The revolver was first described by Stuart Lake in his highly fictionalized 1931 biography \"\". The extremely popular book turned Wyatt Earp into a \"Western superman\". Lake's creative biography",
            "the heads to accommodate a lower hoodline. However, the 1959 389 engines had the generator in front of the heads with reverse flow cooling still in use. This suggests that the cost of the reverse cooling was the reason for the change to \"equa-flow\" cooling. Most iterations had an overall length (to the edge of the water pump pulley) of , an overall width of , and a height (not including air cleaner) of . All Pontiac engines (except the 303 Ram Air V engine and 265 and 301) used connecting rods. Dry weight ranged from , depending on displacement"
        ],
        "wiki_knowledge_title": [
            "\"Metropolis–Hastings algorithm\"",
            "\"Washington Capitals\"",
            "\"Contour line\"",
            "\"Colt Buntline\"",
            "\"Pontiac V8 engine\""
        ],
        "wiki_knowledge_score": [
            93.50149536132812,
            91.93135833740234,
            90.7872085571289,
            88.99751281738281,
            87.53034973144531
        ],
        "reddit_knowledge": [
            "The Internet is a sad place. You seem lovely :) I think you are very pretty and your hair and eyes are great and I love your outfit. Please try not to take meanies to heart. ",
            "I happen to be scrolling, see a double rainbow then realize who posted it. Too funny. I love it!",
            "Omg please share your skin care regimen with us! You are glowing! ",
            "I'm so happy you're inspired to work on your art and express yourself!! I'd love to see some of your drawings when you finish some <3 ",
            "Well, it appears you are as gorgeous as your username is awesome. Would love to see you on a good day and smiling :)\n\nBloop beep!"
        ],
        "reddit_knowledge_title": [
            "",
            "",
            "",
            "",
            ""
        ],
        "reddit_knowledge_score": [
            108.33058166503906,
            108.25143432617188,
            108.02002716064453,
            107.99150848388672,
            107.94155883789062
        ]
    },
    {
        "dialog_id": "test-5",
        "post": "Elon Musk: My commitment to free speech extends even to not banning the account following my plane, even though that is a direct personal safety risk",
        "response": "DEMO ONLY",
        "wiki_knowledge": [
            "2.44 and the average family size was 2.93. In the CDP, the population was spread out with 27.4% under the age of 18, 4.2% from 18 to 24, 32.6% from 25 to 44, 22.1% from 45 to 64, and 13.7% who were 65 years of age or older. The median age was 38 years. For every 100 females, there were 111.1 males. For every 100 females age 18 and over, there were 97.1 males. The median income for a household in the CDP was $48,654, and the median income for a family was $48,654. Males had a median income of",
            "washed away, and the water tower was knocked down. A report by the State indicated that roughly 285 people in Mexico Beach had declined to evacuate the area, although some of those may have left before the peak of the storm. The death toll had not be determined as of October 12, but Brock Long of FEMA was not optimistic: \"Very few people live to tell what it's like to experience storm surge, and unfortunately in this country we seem to not learn the lesson\". At that time, Mayor Al Cathey told residents it might be months before electricity, water,",
            "divorced in May 1996. Yates later moved in with Hutchence, and had a daughter with him. Hutchence committed suicide in a hotel room on 22 November 1997. After Hutchence's death, Geldof and Yates each gave police statements on the phone calls they exchanged with Hutchence that morning but did not volunteer their phone records. Yates' statement on 26 November included \"He was frightened and couldn't stand a minute more without his baby ... [he] was terribly upset and he said, 'I don't know how I'll live without seeing Tiger.'\" Yates contended that Geldof had repeatedly said, \"Don't forget, I am",
            "with tea but the Manchus do, and the elite of the Qing Dynasty of the Chinese Empire continued to do so. Hong Kong-style milk tea is based on British colonial habits. Tibetans and other Himalayan peoples traditionally drink tea with milk or yak butter and salt. In Eastern European countries (Russia, Poland and Hungary) and in Italy, tea is commonly served with lemon juice. In Poland, tea with milk is called a \"bawarka\" (\"Bavarian style\"), and is often drunk by pregnant and nursing women. In Australia, tea with milk is \"white tea\". The order of steps in preparing a cup",
            "General Tom Thumb (Charles Sherwood Stratton) visited Stamford in 1846 and donated one of Thumb's costumes to Dixon to be displayed alongside Lambert's. General Tom Thumb visited Stamford again in 1859 and was tied up inside one of Lambert's stockings. In 1866, General Tom Thumb, with his equally short wife Lavinia Warren (Mercy Lavinia Warren Bump), her sister Minnie Warren (Huldah Pierce Warren Bump) and Barnum's other celebrated dwarf Commodore Nutt (George Washington Morrison Nutt) visited Stamford. All four were able to pass through the knee of Lambert's breeches together. In 1866, Lambert's and Tom Thumb's clothes were sold to"
        ],
        "wiki_knowledge_title": [
            "\"Cundiyo, New Mexico\"",
            "\"Mexico Beach, Florida\"",
            "\"Bob Geldof\"",
            "Tea",
            "\"Daniel Lambert\""
        ],
        "wiki_knowledge_score": [
            88.65650939941406,
            87.30402374267578,
            86.8701171875,
            85.7895736694336,
            84.78655242919922
        ],
        "reddit_knowledge": [
            "I hope this is ok... As a bi man I need to say I love how manly you look. The hairstyle is super nice. But what stands out the most is the eyes. Me being a colourblind bisexual man Im not sure what colour they are, but they made me pause scrolling the reddit.",
            "You're such a beautiful person, honestly you could be a model! Keep walking tall and looking above all the nonsense :)",
            "You look absolutely lovely in the photo. Your haircut suits you and I am always a sucker for a genuine smile. You got that! It's super cute. You're!!! Super cute. Yay!\n\nI hope today goes well for you. I hope that this helped a bit...or a tad...or a bunch. I dunno! I'm like Tyrion Lannister most days. \n\n'I drink and I know things.' ;P Quite a quote of the day, huh? Be positive and be kind to others today. It will be good for you!",
            "You are very attractive! A sweet smile and your suit looks really nice on you. By the way, you kind of look like Nev Schulman from the show Catfish lol he's handsome like you.",
            "You look awesome!!! If I were single, I'd feel lucky to be having a conversation with you :)"
        ],
        "reddit_knowledge_title": [
            "",
            "",
            "",
            "",
            ""
        ],
        "reddit_knowledge_score": [
            92.505615234375,
            92.30056762695312,
            92.23672485351562,
            91.74634552001953,
            91.0513687133789
        ]
    },
    {
        "dialog_id": "test-6",
        "post": "Thinking of dropping out and beomcing an açaí bowl promoter",
        "response": "DEMO ONLY",
        "wiki_knowledge": [
            "responded with a poem: <poem>I discover my photographic death. Do I exist? I am a little black, I am a little white, I am a little shit, On Fidel's vest.</poem> In the early 1990s, he moved to Puerto Rico, where he lived in semi-retirement. In 1996, he founded \"Carta de Cuba\", a quarterly journal featuring work produced in Cuba by independent journalists and writers. He edited the publication until his death on April 16, 2010, in Puerto Rico. Carlos Franqui Carlos Franqui (December 4, 1921 – April 16, 2010) was a Cuban writer, poet, journalist, art critic, and political activist.",
            "washed away, and the water tower was knocked down. A report by the State indicated that roughly 285 people in Mexico Beach had declined to evacuate the area, although some of those may have left before the peak of the storm. The death toll had not be determined as of October 12, but Brock Long of FEMA was not optimistic: \"Very few people live to tell what it's like to experience storm surge, and unfortunately in this country we seem to not learn the lesson\". At that time, Mayor Al Cathey told residents it might be months before electricity, water,",
            "action, which uses changes of pressure within lead tubing to operate pneumatic valves throughout the instrument. This allowed a lighter touch, and more flexibility in the location of the console, within a 50-foot (15-m) limit. This type of construction was used in the late 19th century to early 20th century, and has had only rare application since the 1920s. A more recent development is the electric action which uses low voltage DC to control the key and/or stop mechanisms. Electricity may control the action indirectly through air pressure valves (pneumatics), in which case the action is electro-pneumatic. In such actions,",
            "later told how Reavis had given Miguel Noe information about Don José Maso, his supposed close friend, for Noe to commit to memory. As part of the agreement, Noe was expected to locate other persons willing to memorize and testify to other events. On September 6, 1894, the government requested a judge be commissioned to take testimony. Despite protests from Reavis' attorney, Judge Thomas C. Fuller was appointed. Testimony was taken in Guadalajara between October 16 and October 26, 1894. Despite being informed of the proceedings, no one representing Reavis attended the proceedings. The most likely explanation for this is",
            "1931 75 mm anti-aircraft guns at the Reșița works, with the first battery of 6 guns entering service on 1 August 1939, and 100 more guns were built during the war for a total production of 200. On 14 June, Romania launched the first locally-built warship, the minelayer \"Amiral Murgescu\". During the war, Romania copied and produced hundreds of Soviet M1938 mortars, as well as designing and producing up to 400 75 mm Reșița Model 1943 anti-tank guns. Infantry weapons designed and produced by Romania during the war include the Orița M1941 sub-machinegun and the Argeș flamethrower. Romania also built"
        ],
        "wiki_knowledge_title": [
            "\"Carlos Franqui\"",
            "\"Mexico Beach, Florida\"",
            "\"Pipe organ\"",
            "\"James Reavis\"",
            "\"Kingdom of Romania\""
        ],
        "wiki_knowledge_score": [
            80.47695922851562,
            79.87020874023438,
            77.39588165283203,
            76.02827453613281,
            74.48310852050781
        ],
        "reddit_knowledge": [
            "want to buy ",
            "See if you can do summer school elsewhere like a community college for the class.",
            "i hope you have good weekend too",
            "maybe chill out on all this candy you stole",
            "I mean, I'd ask you out."
        ],
        "reddit_knowledge_title": [
            "",
            "",
            "",
            "",
            ""
        ],
        "reddit_knowledge_score": [
            127.50829315185547,
            122.4422836303711,
            120.53924560546875,
            120.43547821044922,
            119.64610290527344
        ]
    }
]
